# Importing Libraries

In [1]:
#Importing Libraries
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#Loading basics and ratings data
basics=pd.read_csv('Data/title_basics.csv.gz')
ratings=pd.read_csv('Data/title.ratings.csv.gz')
#Loading early 2000's movies
early_2k_movies = pd.read_csv('Data/early_2k_movies.csv')

# Exploring Data

In [3]:
#Exploring basics movie data
basics.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001.0,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [4]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143594 entries, 0 to 143593
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          143594 non-null  object
 1   titleType       143594 non-null  object
 2   primaryTitle    143594 non-null  object
 3   originalTitle   143594 non-null  object
 4   isAdult         143594 non-null  int64
 5   startYear       143594 non-null  float64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  143594 non-null  int64
 8   genres          143594 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 9.9+ MB

In [5]:
#Exploring ratings data
ratings.head(5)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1914
1  tt0000002            5.8       259
2  tt0000003            6.5      1720
3  tt0000004            5.6       172
4  tt0000005            6.2      2537

In [6]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1262175 entries, 0 to 1262174
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1262175 non-null  object
 1   averageRating  1262175 non-null  float64
 2   numVotes       1262175 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.9+ MB

In [7]:
# Explore early 2000's movies
early_2k_movies.head(5)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certifcation
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1985.0,PG
1,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.851,47.0,R
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.134,160.0,R
3,tt0119495,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",NaN,51181.0,en,Love 101,...,0.0,86.0,[],Released,NaN,Love 101,0.0,0.000,0.0,R
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.400,42.0,R

In [8]:
early_2k_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 820 entries, 0 to 819
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                820 non-null    object
 1   adult                  820 non-null    float64
 2   backdrop_path          612 non-null    object
 3   belongs_to_collection  107 non-null    object
 4   budget                 820 non-null    float64
 5   genres                 820 non-null    object
 6   homepage               97 non-null     object
 7   id                     820 non-null    float64
 8   original_language      820 non-null    object
 9   original_title         820 non-null    object
 10  overview               819 non-null    object
 11  popularity             820 non-null    float64
 12  poster_path            783 non-null    object
 13  production_companies   820 non-null    object
 14  production_countries   820 non-null    object
 15  release_date           820 non-null    object
 16  revenue                820 non-null    float64
 17  runtime                820 non-null    float64
 18  spoken_languages       820 non-null    object
 19  status                 820 non-null    object
 20  tagline                608 non-null    object
 21  title                  820 non-null    object
 22  video                  820 non-null    float64
 23  vote_average           820 non-null    float64
 24  vote_count             820 non-null    float64
 25  certifcation           820 non-null    object
dtypes: float64(9), object(17)
memory usage: 166.7+ KB

# Transformations

## Normalizing Early 2000's Data

In [9]:
#To keep only id, revenue, budget and certification from early 2000's data
early_2k_movies = early_2k_movies[['imdb_id','revenue','budget','certifcation']]
early_2k_movies

       imdb_id     revenue      budget certifcation
0    tt0118694  12854953.0    150000.0           PG
1    tt0118852         0.0         0.0            R
2    tt0119273         0.0  15000000.0            R
3    tt0119495         0.0         0.0            R
4    tt0120467     14904.0    120000.0            R
..         ...         ...         ...          ...
815  tt0832449         0.0         0.0        PG-13
816  tt1073223         0.0         0.0        PG-13
817  tt2145114         0.0         0.0           NR
818  tt3041064         0.0         0.0           NR
819  tt8795764         0.0         0.0           NR

[820 rows x 4 columns]

In [10]:
# To change imdb_id to tconst as a consistent primary key for each column
#early_2k_movies = early_2k_movies.rename(columns = {'imdb_id':'tconst'})
#Verifying that the column name change was successful
#early_2k_movies.info()

## Normalizing the Genres

In [11]:
# To create a column with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001.0,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
143589,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
143590,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
143591,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,[Thriller]
143592,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"
143593,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]

In [12]:
# using .explode() to separate the list of genres into new rows:
# one row for each genre a movie belonged to.

genres_exploded = basics.explode('genres_split')
genres_exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
143590,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
143591,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,Thriller
143592,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
143592,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History
143593,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,Drama

In [13]:
# Converting string column to list
#genres_split = basics['genres'].str.split(",")
# Explode and take unique genre entries only
#unique_genres = genres_split.explode().unique()
#unique_genres

In [14]:
# using .unique() to get the unique genres from the genres_split column

unique_genres = sorted(genres_exploded['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [15]:
# Creating a new genre title table
genre_title = genres_exploded[['tconst','genres_split']].copy()
genre_title.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [16]:
# Create a genre mapping dictionary to replace string genres with integers
## Making the genre mapping dictionary

genre_integers = range(len(unique_genres))
genre_mapping = dict(zip(unique_genres, genre_integers))
genre_mapping

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [17]:
# Making a genre id mapping dictionary
#genre_id_mapping = dict(zip(unique_genres,range(len(unique_genres))))
#genre_id_mapping

In [18]:
# making a new integer genre_id and drop string genres
genre_title['genre_id'] = genre_title['genres_split'].map(genre_mapping)
genre_title = genre_title.drop(columns = 'genres_split')
genre_title

           tconst  genre_id
0       tt0035423         5
0       tt0035423         9
0       tt0035423        18
1       tt0062336         7
2       tt0069049         7
...           ...       ...
143590  tt9916190        23
143591  tt9916270        23
143592  tt9916362         7
143592  tt9916362        11
143593  tt9916538         7

[248964 rows x 2 columns]

In [20]:
# converting genre mapping into a dataframe
genre_df = pd.DataFrame({'genre_name': genre_mapping.keys(),
                            'genre_id': genre_mapping.values()})
genre_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [21]:
# Discarding unnecessary information in Basics.
basics = basics.drop(columns=['originalTitle', 'isAdult','titleType', 'genres',
                             'genres_split'])
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0079644,November 1828,2001.0,NaN,140
4,tt0088751,The Naked Monster,2005.0,NaN,100
...,...,...,...,...,...
143589,tt9916170,The Rehearsal,2019.0,NaN,51
143590,tt9916190,Safeguard,2020.0,NaN,95
143591,tt9916270,Il talento del calabrone,2020.0,NaN,84
143592,tt9916362,Coven,2020.0,NaN,92
143593,tt9916538,Kuambil Lagi Hatiku,2019.0,NaN,123

# SQL

## Creating Database

In [22]:
#loading mysql credentials
with open('/users/swaghanaian/secret/my_sql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [23]:
# creating connection to database
from urllib.parse import quote_plus as urlquote
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/makin_better_movies.sql"
engine = create_engine(connection)

In [24]:
# check if db exists, if not create it
if database_exists(connection):
    print('Already Exists')
else:
    create_database(connection)
    print('Database Created')

Already Exists

## Saving MySQL Table With 'tconst' as the Primary Key

Since tconst is a string, the below steps need to be completed

In [25]:
# get max string length of data in basics dataframe
max_str_len = basics['tconst'].fillna('').map(len).max()
max_str_len

10

In [26]:
#Use 1 larger than the max_str/text_len `string(max_str_len +1 )`.

from sqlalchemy.types import *
# calculate max string length for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
df_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer()
}

In [27]:
basics.to_sql('basics', engine, dtype=df_schema, index=False, if_exists = 'replace')

143594

In [28]:
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')

In [29]:
key_len = ratings['tconst'].fillna('').map(len).max()
df_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()
}

In [30]:
ratings.to_sql('ratings', engine, dtype=df_schema, index = False,if_exists = 'replace')

1262175

In [31]:
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

In [32]:
# create title_genre schema dictionary
key_len = genre_title['tconst'].fillna('').map(len).max()
genre_title_table ={
    'tconst': String(key_len+1),
    'genre_id': Integer()
}

In [33]:
genre_title.to_sql('genre_title', engine, dtype=genre_title_table, index=False, if_exists = 'replace')

248964

In [35]:
# create title_genre schema dictionary
key_len = genre_df['genre_name'].fillna('').map(len).max()
df_schema ={
    'genre_name': String(key_len+1),
    'genre_id': Integer()
}

In [36]:
genre_df.to_sql('genre_df', engine, dtype=df_schema, index=False, if_exists = 'replace')

26

In [38]:
engine.execute('ALTER TABLE genre_df ADD PRIMARY KEY (`genre_id`);')

In [39]:
key_len = early_2k_movies['imdb_id'].fillna('').map(len).max()
certification_len = early_2k_movies['certifcation'].fillna('').map(len).max()
df_schema ={
    'imdb_id': String(key_len+1),
    'budget': Float(),
    'revenue': Float(),
    'certifcation': String(certification_len+1)
}

In [40]:
early_2k_movies.to_sql('tmdb_data', engine, dtype=df_schema, index=False, if_exists = 'replace')

820

In [41]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

## Testing the Queries

In [42]:
# check if tables loaded
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_makin_better_movies.sql
0                            basics
1                   early_2k_movies
2                          genre_df
3                       genre_title
4                           ratings
5                         tmdb_data

In [43]:
# test query for basics
q = """SELECT * FROM basics LIMIT 5;"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100

In [44]:
# test query for ratings
q = """SELECT * FROM ratings LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1914
1  tt0000002            5.8       259
2  tt0000003            6.5      1720
3  tt0000004            5.6       172
4  tt0000005            6.2      2537

In [45]:
# test query for early_2k_movies
q = """SELECT * FROM early_2k_movies LIMIT 5;"""
pd.read_sql(q,engine)

      tconst     revenue      budget certifcation
0  tt0035423  76019000.0  48000000.0        PG-13
1  tt0118589   5271670.0  22000000.0        PG-13
2  tt0118652         0.0   1000000.0            R
3  tt0118694  12855000.0    150000.0           PG
4  tt0118852         0.0         0.0            R

In [47]:
# test query for title_genres
q = """SELECT * FROM genre_title LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [49]:
# test query for genres_lookup
q = """SELECT * FROM genre_df LIMIT 5;"""
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4